app/Models/ModelLampiran.php

SELECT *
FROM `tbl_lampiran`
ORDER BY `id_lampiran` ASC
---
    public function getAllData()
    {
        return $this->db->table('tbl_lampiran')
        ->orderBy('id_lampiran', 'ASC')
        ->get()
        ->getResultArray();